In [1]:
import pandas as pd

# Series

In [2]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
D = {1:'a',2:'b',3:'c'}
s1 = pd.Series(D)
s1

1    a
2    b
3    c
dtype: object

In [4]:
import numpy as np
a = np.array([1,2,3,4,5])
s2 = pd.Series(a)
s2

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [5]:
import numpy as np
a = np.array([1,2,3,4,5])
s2 = pd.Series(a,index=['a','b','c','d','e'])
s2

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [8]:
a = np.array([1,2,3,np.nan])
s3 = pd.Series(a,index=['a','b','c','d'])
s3

a    1.0
b    2.0
c    3.0
d    NaN
dtype: float64

# Data Frame

In [11]:
a = np.array([1,2,3,np.nan])
D = pd.DataFrame(a)
D

     0
0  1.0
1  2.0
2  3.0
3  NaN

In [9]:
n = np.array([(1,2,3),(4,5,6),(7,8,9)])
D = pd.DataFrame(n)
D

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
Dict = {'Name':['Arvind','Amit'],'age':[40,41]}
Dict

{'Name': ['Arvind', 'Amit'], 'age': [40, 41]}

In [13]:
D1 = pd.DataFrame(Dict)
D1

     Name  age
0  Arvind   40
1    Amit   41

In [17]:
date_d = pd.date_range('20221220',periods=6,freq='D')
date_d

DatetimeIndex(['2022-12-20', '2022-12-21', '2022-12-22', '2022-12-23',
               '2022-12-24', '2022-12-25'],
              dtype='datetime64[ns]', freq='D')

In [31]:
from numpy import random

In [33]:
randata = random.randint(101,size=(6,4))
randata

array([[65, 12, 64, 97],
       [19, 35, 49,  2],
       [91, 25, 30, 23],
       [72, 60, 37, 90],
       [45, 98, 28, 57],
       [22,  1, 10, 71]])

In [35]:
DF = pd.DataFrame(randata)
DF

    0   1   2   3
0  65  12  64  97
1  19  35  49   2
2  91  25  30  23
3  72  60  37  90
4  45  98  28  57
5  22   1  10  71

In [34]:
DF = pd.DataFrame(randata,index=list('ABCDEF'),columns=list('WXYZ'))
DF

    W   X   Y   Z
A  65  12  64  97
B  19  35  49   2
C  91  25  30  23
D  72  60  37  90
E  45  98  28  57
F  22   1  10  71